<h2 style='color:purple' align='center'>Naive Bayes Tutorial Part 1: Predicting survival from titanic crash</h2>

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("titanic.csv")
df.head(10)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
5,6,"Moran, Mr. James",3,male,NaN,0,0,330877,8.4583,NaN,Q,0
6,7,"McCarthy, Mr. Timothy J",1,male,54.0,0,0,17463,51.8625,E46,S,0
7,8,"Palsson, Master. Gosta Leonard",3,male,2.0,3,1,349909,21.0750,NaN,S,0
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",3,female,27.0,0,2,347742,11.1333,NaN,S,1
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",2,female,14.0,1,0,237736,30.0708,NaN,C,1

In [4]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head(10)

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0
5       3    male   NaN   8.4583         0
6       1    male  54.0  51.8625         0
7       3    male   2.0  21.0750         0
8       3  female  27.0  11.1333         1
9       2  female  14.0  30.0708         1

In [8]:
drop_value = df.drop('Survived',axis='columns')
main = df.Survived

In [9]:
drop_value.head(10)

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500
5       3    male   NaN   8.4583
6       1    male  54.0  51.8625
7       3    male   2.0  21.0750
8       3  female  27.0  11.1333
9       2  female  14.0  30.0708

In [5]:
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [10]:
dummy_value = pd.get_dummies(inputs.Sex)
dummy_value.head(5)

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [11]:
inputs = pd.concat([inputs,dummy_value],axis='columns')
inputs.head(5)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

**I am dropping male column as well because of dummy variable trap theory. One column is enough to repressent male vs female**

In [12]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(5)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [14]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [10]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [15]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [17]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.25)

In [18]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [19]:
model.fit(X_train,y_train)

GaussianNB()

In [20]:
model.score(X_test,y_test)

0.7802690582959642

In [21]:
X_test[0:10]

     Pclass        Age     Fare  female
148       2  36.500000  26.0000       0
170       1  61.000000  33.5000       0
47        3  29.699118   7.7500       1
225       3  22.000000   9.3500       0
267       3  25.000000   7.7750       0
616       3  34.000000  14.4000       0
774       2  54.000000  23.0000       1
480       3   9.000000  46.9000       0
261       3   3.000000  31.3875       0
833       3  23.000000   7.8542       0

In [22]:
y_test[0:10]

148    0
170    0
47     1
225    0
267    1
616    0
774    1
480    0
261    1
833    0
Name: Survived, dtype: int64

In [23]:
model.predict(X_test[0:10])

array([0, 0, 1, 0, 0, 0, 1, 0, 0, 0], dtype=int64)

In [24]:
model.predict_proba(X_test[:10])

array([[0.92492597, 0.07507403],
       [0.59044588, 0.40955412],
       [0.47266656, 0.52733344],
       [0.96285022, 0.03714978],
       [0.96472217, 0.03527783],
       [0.96709931, 0.03290069],
       [0.20192987, 0.79807013],
       [0.91477813, 0.08522187],
       [0.91185396, 0.08814604],
       [0.96345631, 0.03654369]])

**Calculate the score using cross validation**

In [25]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.76865672, 0.7238806 , 0.75373134, 0.79699248, 0.78947368])